/**
 * 验证URL网址的格式
 */

let str = 'http://www.baidu.com/'

/**
 * 验证URL网址的格式
 * 1.协议:  http/https/ftp
 * 2.域名: www.xxx.com|cn / xxxxx.com|cn / xxx.xxxx.xxxxx.xx.com|cn
 * 3.请求路径: /xxx.html / /xxx/xxxx.html / /xx/
 * 4.问号传参: ?xxx= xxxx&xxxx= xx
 * 5.哈希值: #xxx
 *  */ 
//  let reg = /^((http|https|ftp):\/\/)?$/i
/**
 * 协议
 * /^((http|https|ftp):\/\/)?$/i
 * ^: 以xx开头
 * $: 以xxx结尾
 * ?: 出现0-1次
 * (:\/\/): ://
 * |: 或者
 * i: 忽略大小写匹配
 */
//  let reg = /^((http|https|ftp):\/\/)?(([\w-]+\.)+[a-z0-9]+)$/i
/**
 * 域名
 * (([\w-]+\.)+[a-z0-9]+)
 * 1.([\w-]+\.)+
   * +: 出现1到多次
   * \w: 数字或字母或下划线或汉字 等介于[A-Za-z0-9_]
   * -: 中划线
   * \.: 转译.
 * 2.[a-z0-9]+
 */
//  let reg = /^((http|https|ftp):\/\/)?(([\w-]+\.)+[a-z0-9]+)((\/[^/?#]*)+)?$/i
/**
 * 请求路径
 * ((\/[^/?#]*)+)?
 * ^:非 => [^/?#] 代表非 斜杠,问号,井号
 * *: 零到多位
 */

// let reg = /^((http|https|ftp):\/\/)?(([\w-]+\.)+[a-z0-9]+)((\/[^/?#]*)+)?(\?[^#]+)?$/i
/**
 * 问号传参
 * (\?[^#]+)?
 * 代表：没有到#, 就没有到哈希
 */

let reg = /^((http|https|ftp):\/\/)?(([\w-]+\.)+[a-z0-9]+)((\/[^/?#]*)+)?(\?[^#]+)?(#.+)?$/i
/**
 * 哈希值
 * (#.+)?
 * .: 匹配除换行符以外的任意字符
 * (): 分组
 */

console.log(reg.exec(str))
/**
 * exec:捕获
 * 正则里面加'?:'可以让某个小分组只匹配不捕获 
 */