/**
 * 正向预查 (?=pattern)
 * 要匹配的字符串必须满足pattern这个条件
 * 设置的条件pattern不参与捕获
 */
/** 要求：包含有大小写字母和数字,必须包含小写字母*/
let reg = /(?=.*[a-z]+)^[a-zA-Z0-9]{1,}$/
 /**
 * 负向预查 (?!pattern)
 * 要匹配的字符串必须*不*满足pattern这个条件
 * 设置的条件pattern不参与捕获
 */
/* 要求：6-16位的字符串，必须同时包含有大小写字母和数字*/
let reg1 = /(?!^[a-zA-Z]+$)(?!^[0-9]+$)(?!^[A-Z0-9]+$)(?!^[a-z0-9]+$)^[a-zA-Z0-9]{6,16}$/
/**
 * (?![a-z]+) : 不能纯小写字母
 */

 /** 要求：至少包括数字、小写字母、大写字母和特殊符号中的三种*/
 let reg2 = /((?=.*[0-9])(?=.*[A-Z])(?=.*[a-z])|(?=.*[0-9])(?=.*[a-z])(?=.*[~`!@#$%^&*?])|(?=.*[A-Z])(?=.*[a-z])(?=.*[~`!@#$%^&*?])|(?=.*[0-9])(?=.*[A-Z])(?=.*[~`!@#$%^&*?]))^[0-9A-Za-z~`!@#$%^&*?]{8,20}$/